nxp-mcuxpresso/mcux-sdk/boards/evkmimxrt1020/project_template/pin_mux.h
/*
 * Copyright 2018 NXP.
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/* GPIO_AD_B0_07 (number 101), UART1_RXD/J17[4] */
#define BOARD_INITDEBUG_UARTPINS_UART1_RXD_PERIPHERAL                    LPUART1   /*!< Device name: LPUART1 */
#define BOARD_INITDEBUG_UARTPINS_UART1_RXD_SIGNAL                             RX   /*!< LPUART1 signal: RX */
#define BOARD_INITDEBUG_UARTPINS_UART1_RXD_PIN_NAME                GPIO_AD_B0_07   /*!< Pin name */
#define BOARD_INITDEBUG_UARTPINS_UART1_RXD_LABEL              "UART1_RXD/J17[4]"   /*!< Label */
#define BOARD_INITDEBUG_UARTPINS_UART1_RXD_NAME                      "UART1_RXD"   /*!< Identifier name */

/* GPIO_AD_B0_06 (number 105), UART1_TXD/J17[6] */
#define BOARD_INITDEBUG_UARTPINS_UART1_TXD_PERIPHERAL                    LPUART1   /*!< Device name: LPUART1 */
#define BOARD_INITDEBUG_UARTPINS_UART1_TXD_SIGNAL                             TX   /*!< LPUART1 signal: TX */
#define BOARD_INITDEBUG_UARTPINS_UART1_TXD_PIN_NAME                GPIO_AD_B0_06   /*!< Pin name */
#define BOARD_INITDEBUG_UARTPINS_UART1_TXD_LABEL              "UART1_TXD/J17[6]"   /*!< Label */
#define BOARD_INITDEBUG_UARTPINS_UART1_TXD_NAME                      "UART1_TXD"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void);

/* GPIO_EMC_16 (number 142), SEMC_A0/U14[23]/BOOT_MODE[0] */
#define BOARD_INITSDRAMPINS_SEMC_A0_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAMPINS_SEMC_A0_SIGNAL                                  ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSDRAMPINS_SEMC_A0_CHANNEL                                   0U   /*!< SEMC ADDR channel: 00 */
#define BOARD_INITSDRAMPINS_SEMC_A0_PIN_NAME                         GPIO_EMC_16   /*!< Pin name */
#define BOARD_INITSDRAMPINS_SEMC_A0_LABEL         "SEMC_A0/U14[23]/BOOT_MODE[0]"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_A0_NAME                               "SEMC_A0"   /*!< Identifier name */

/* GPIO_EMC_17 (number 141), SEMC_A1/U14[24]/BOOT_MODE[1] */
#define BOARD_INITSDRAMPINS_SEMC_A1_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAMPINS_SEMC_A1_SIGNAL                                  ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSDRAMPINS_SEMC_A1_CHANNEL                                   1U   /*!< SEMC ADDR channel: 01 */
#define BOARD_INITSDRAMPINS_SEMC_A1_PIN_NAME                         GPIO_EMC_17   /*!< Pin name */
#define BOARD_INITSDRAMPINS_SEMC_A1_LABEL         "SEMC_A1/U14[24]/BOOT_MODE[1]"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_A1_NAME                               "SEMC_A1"   /*!< Identifier name */

/* GPIO_EMC_18 (number 140), SEMC_A2/U14[25]/BT_CFG[0] */
#define BOARD_INITSDRAMPINS_SEMC_A2_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAMPINS_SEMC_A2_SIGNAL                                  ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSDRAMPINS_SEMC_A2_CHANNEL                                   2U   /*!< SEMC ADDR channel: 02 */
#define BOARD_INITSDRAMPINS_SEMC_A2_PIN_NAME                         GPIO_EMC_18   /*!< Pin name */
#define BOARD_INITSDRAMPINS_SEMC_A2_LABEL            "SEMC_A2/U14[25]/BT_CFG[0]"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_A2_NAME                               "SEMC_A2"   /*!< Identifier name */

/* GPIO_EMC_19 (number 139), SEMC_A3/U14[26]/BT_CFG[1] */
#define BOARD_INITSDRAMPINS_SEMC_A3_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAMPINS_SEMC_A3_SIGNAL                                  ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSDRAMPINS_SEMC_A3_CHANNEL                                   3U   /*!< SEMC ADDR channel: 03 */
#define BOARD_INITSDRAMPINS_SEMC_A3_PIN_NAME                         GPIO_EMC_19   /*!< Pin name */
#define BOARD_INITSDRAMPINS_SEMC_A3_LABEL            "SEMC_A3/U14[26]/BT_CFG[1]"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_A3_NAME                               "SEMC_A3"   /*!< Identifier name */

/* GPIO_EMC_20 (number 138), SEMC_A4/U14[29]/BT_CFG[2] */
#define BOARD_INITSDRAMPINS_SEMC_A4_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAMPINS_SEMC_A4_SIGNAL                                  ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSDRAMPINS_SEMC_A4_CHANNEL                                   4U   /*!< SEMC ADDR channel: 04 */
#define BOARD_INITSDRAMPINS_SEMC_A4_PIN_NAME                         GPIO_EMC_20   /*!< Pin name */
#define BOARD_INITSDRAMPINS_SEMC_A4_LABEL            "SEMC_A4/U14[29]/BT_CFG[2]"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_A4_NAME                               "SEMC_A4"   /*!< Identifier name */

/* GPIO_EMC_22 (number 136), SEMC_A6/U14[31]/BT_CFG[4] */
#define BOARD_INITSDRAMPINS_SEMC_A6_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAMPINS_SEMC_A6_SIGNAL                                  ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSDRAMPINS_SEMC_A6_CHANNEL                                   6U   /*!< SEMC ADDR channel: 06 */
#define BOARD_INITSDRAMPINS_SEMC_A6_PIN_NAME                         GPIO_EMC_22   /*!< Pin name */
#define BOARD_INITSDRAMPINS_SEMC_A6_LABEL            "SEMC_A6/U14[31]/BT_CFG[4]"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_A6_NAME                               "SEMC_A6"   /*!< Identifier name */

/* GPIO_EMC_21 (number 137), SEMC_A5/U14[30]/BT_CFG[3] */
#define BOARD_INITSDRAMPINS_SEMC_A5_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAMPINS_SEMC_A5_SIGNAL                                  ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSDRAMPINS_SEMC_A5_CHANNEL                                   5U   /*!< SEMC ADDR channel: 05 */
#define BOARD_INITSDRAMPINS_SEMC_A5_PIN_NAME                         GPIO_EMC_21   /*!< Pin name */
#define BOARD_INITSDRAMPINS_SEMC_A5_LABEL            "SEMC_A5/U14[30]/BT_CFG[3]"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_A5_NAME                               "SEMC_A5"   /*!< Identifier name */

