nxp-mcuxpresso/mcux-sdk/boards/evkmimxrt1020/project_template/pin_mux.h
/* GPIO_EMC_30 (number 126), SEMC_CLK/U14[38] */
#define BOARD_INITSDRAMPINS_SEMC_CLK_PERIPHERAL                             SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAMPINS_SEMC_CLK_SIGNAL                             semc_clk   /*!< SEMC signal: semc_clk */
#define BOARD_INITSDRAMPINS_SEMC_CLK_PIN_NAME                        GPIO_EMC_30   /*!< Pin name */
#define BOARD_INITSDRAMPINS_SEMC_CLK_LABEL                    "SEMC_CLK/U14[38]"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_CLK_NAME                             "SEMC_CLK"   /*!< Identifier name */

/* GPIO_EMC_12 (number 3), SEMC_CS0/U14[19] */
#define BOARD_INITSDRAMPINS_SEMC_CS0_PERIPHERAL                             SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAMPINS_SEMC_CS0_SIGNAL                                   CS   /*!< SEMC signal: CS */
#define BOARD_INITSDRAMPINS_SEMC_CS0_CHANNEL                                  0U   /*!< SEMC CS channel: 0 */
#define BOARD_INITSDRAMPINS_SEMC_CS0_PIN_NAME                        GPIO_EMC_12   /*!< Pin name */
#define BOARD_INITSDRAMPINS_SEMC_CS0_LABEL                    "SEMC_CS0/U14[19]"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_CS0_NAME                             "SEMC_CS0"   /*!< Identifier name */

/* GPIO_EMC_09 (number 8), SEMC_WE/U14[16] */
#define BOARD_INITSDRAMPINS_SEMC_WE_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAMPINS_SEMC_WE_SIGNAL                               semc_we   /*!< SEMC signal: semc_we */
#define BOARD_INITSDRAMPINS_SEMC_WE_PIN_NAME                         GPIO_EMC_09   /*!< Pin name */
#define BOARD_INITSDRAMPINS_SEMC_WE_LABEL                      "SEMC_WE/U14[16]"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_WE_NAME                               "SEMC_WE"   /*!< Identifier name */

/* GPIO_EMC_11 (number 4), SEMC_RAS/U14[18] */
#define BOARD_INITSDRAMPINS_SEMC_RAS_PERIPHERAL                             SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAMPINS_SEMC_RAS_SIGNAL                             semc_ras   /*!< SEMC signal: semc_ras */
#define BOARD_INITSDRAMPINS_SEMC_RAS_PIN_NAME                        GPIO_EMC_11   /*!< Pin name */
#define BOARD_INITSDRAMPINS_SEMC_RAS_LABEL                    "SEMC_RAS/U14[18]"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_RAS_NAME                             "SEMC_RAS"   /*!< Identifier name */

/* GPIO_EMC_28 (number 128), SEMC_DQS */
#define BOARD_INITSDRAMPINS_SEMC_DQS_PERIPHERAL                             SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAMPINS_SEMC_DQS_SIGNAL                             semc_dqs   /*!< SEMC signal: semc_dqs */
#define BOARD_INITSDRAMPINS_SEMC_DQS_PIN_NAME                        GPIO_EMC_28   /*!< Pin name */
#define BOARD_INITSDRAMPINS_SEMC_DQS_LABEL                            "SEMC_DQS"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_DQS_NAME                             "SEMC_DQS"   /*!< Identifier name */

/* GPIO_EMC_31 (number 125), SEMC_DM1/U14[39] */
#define BOARD_INITSDRAMPINS_SEMC_DM1_PERIPHERAL                             SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAMPINS_SEMC_DM1_SIGNAL                                   DM   /*!< SEMC signal: DM */
#define BOARD_INITSDRAMPINS_SEMC_DM1_CHANNEL                                  1U   /*!< SEMC DM channel: 1 */
#define BOARD_INITSDRAMPINS_SEMC_DM1_PIN_NAME                        GPIO_EMC_31   /*!< Pin name */
#define BOARD_INITSDRAMPINS_SEMC_DM1_LABEL                    "SEMC_DM1/U14[39]"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_DM1_NAME                             "SEMC_DM1"   /*!< Identifier name */

/* GPIO_EMC_08 (number 9), SEMC_DM0/U14[15] */
#define BOARD_INITSDRAMPINS_SEMC_DM0_PERIPHERAL                             SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAMPINS_SEMC_DM0_SIGNAL                                   DM   /*!< SEMC signal: DM */
#define BOARD_INITSDRAMPINS_SEMC_DM0_CHANNEL                                  0U   /*!< SEMC DM channel: 0 */
#define BOARD_INITSDRAMPINS_SEMC_DM0_PIN_NAME                        GPIO_EMC_08   /*!< Pin name */
#define BOARD_INITSDRAMPINS_SEMC_DM0_LABEL                    "SEMC_DM0/U14[15]"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_DM0_NAME                             "SEMC_DM0"   /*!< Identifier name */

/* GPIO_EMC_39 (number 117), SEMC_D15/U14[53] */
#define BOARD_INITSDRAMPINS_SEMC_D15_PERIPHERAL                             SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAMPINS_SEMC_D15_SIGNAL                                 DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAMPINS_SEMC_D15_CHANNEL                                 15U   /*!< SEMC DATA channel: 15 */
#define BOARD_INITSDRAMPINS_SEMC_D15_PIN_NAME                        GPIO_EMC_39   /*!< Pin name */
#define BOARD_INITSDRAMPINS_SEMC_D15_LABEL                    "SEMC_D15/U14[53]"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_D15_NAME                             "SEMC_D15"   /*!< Identifier name */

/* GPIO_EMC_38 (number 118), SEMC_D14/U14[51] */
#define BOARD_INITSDRAMPINS_SEMC_D14_PERIPHERAL                             SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAMPINS_SEMC_D14_SIGNAL                                 DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAMPINS_SEMC_D14_CHANNEL                                 14U   /*!< SEMC DATA channel: 14 */
#define BOARD_INITSDRAMPINS_SEMC_D14_PIN_NAME                        GPIO_EMC_38   /*!< Pin name */
#define BOARD_INITSDRAMPINS_SEMC_D14_LABEL                    "SEMC_D14/U14[51]"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_D14_NAME                             "SEMC_D14"   /*!< Identifier name */

/* GPIO_EMC_37 (number 119), SEMC_D13/U14[50] */
#define BOARD_INITSDRAMPINS_SEMC_D13_PERIPHERAL                             SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAMPINS_SEMC_D13_SIGNAL                                 DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAMPINS_SEMC_D13_CHANNEL                                 13U   /*!< SEMC DATA channel: 13 */
#define BOARD_INITSDRAMPINS_SEMC_D13_PIN_NAME                        GPIO_EMC_37   /*!< Pin name */
#define BOARD_INITSDRAMPINS_SEMC_D13_LABEL                    "SEMC_D13/U14[50]"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_D13_NAME                             "SEMC_D13"   /*!< Identifier name */

/* GPIO_EMC_36 (number 120), SEMC_D12/U14[48] */
#define BOARD_INITSDRAMPINS_SEMC_D12_PERIPHERAL                             SEMC   /*!< Device name: SEMC */
#define BOARD_INITSDRAMPINS_SEMC_D12_SIGNAL                                 DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSDRAMPINS_SEMC_D12_CHANNEL                                 12U   /*!< SEMC DATA channel: 12 */
#define BOARD_INITSDRAMPINS_SEMC_D12_PIN_NAME                        GPIO_EMC_36   /*!< Pin name */
#define BOARD_INITSDRAMPINS_SEMC_D12_LABEL                    "SEMC_D12/U14[48]"   /*!< Label */
#define BOARD_INITSDRAMPINS_SEMC_D12_NAME                             "SEMC_D12"   /*!< Identifier name */

