nxp-mcuxpresso/mcux-sdk/boards/evkmimxrt1020/project_template/pin_mux.h
/* GPIO_AD_B0_13 (number 95), ENET_TXEN/U11[23]/J19[5] */
#define BOARD_INITENETPINS_ENET_TXEN_PERIPHERAL                             ENET   /*!< Device name: ENET */
#define BOARD_INITENETPINS_ENET_TXEN_SIGNAL                           enet_tx_en   /*!< ENET signal: enet_tx_en */
#define BOARD_INITENETPINS_ENET_TXEN_PIN_NAME                      GPIO_AD_B0_13   /*!< Pin name */
#define BOARD_INITENETPINS_ENET_TXEN_LABEL            "ENET_TXEN/U11[23]/J19[5]"   /*!< Label */
#define BOARD_INITENETPINS_ENET_TXEN_NAME                            "ENET_TXEN"   /*!< Identifier name */

/* GPIO_AD_B0_15 (number 93), ENET_TXD1/U11[25]/J19[2] */
#define BOARD_INITENETPINS_ENET_TXD1_PERIPHERAL                             ENET   /*!< Device name: ENET */
#define BOARD_INITENETPINS_ENET_TXD1_SIGNAL                         enet_tx_data   /*!< ENET signal: enet_tx_data */
#define BOARD_INITENETPINS_ENET_TXD1_CHANNEL                                  1U   /*!< ENET enet_tx_data channel: 1 */
#define BOARD_INITENETPINS_ENET_TXD1_PIN_NAME                      GPIO_AD_B0_15   /*!< Pin name */
#define BOARD_INITENETPINS_ENET_TXD1_LABEL            "ENET_TXD1/U11[25]/J19[2]"   /*!< Label */
#define BOARD_INITENETPINS_ENET_TXD1_NAME                            "ENET_TXD1"   /*!< Identifier name */

/* GPIO_AD_B0_14 (number 94), ENET_TXD0/U11[24]/J17[7] */
#define BOARD_INITENETPINS_ENET_TXD0_PERIPHERAL                             ENET   /*!< Device name: ENET */
#define BOARD_INITENETPINS_ENET_TXD0_SIGNAL                         enet_tx_data   /*!< ENET signal: enet_tx_data */
#define BOARD_INITENETPINS_ENET_TXD0_CHANNEL                                  0U   /*!< ENET enet_tx_data channel: 0 */
#define BOARD_INITENETPINS_ENET_TXD0_PIN_NAME                      GPIO_AD_B0_14   /*!< Pin name */
#define BOARD_INITENETPINS_ENET_TXD0_LABEL            "ENET_TXD0/U11[24]/J17[7]"   /*!< Label */
#define BOARD_INITENETPINS_ENET_TXD0_NAME                            "ENET_TXD0"   /*!< Identifier name */

/* GPIO_AD_B0_12 (number 96), ENET_RXER/U11[20]/J19[4] */
#define BOARD_INITENETPINS_ENET_RXER_PERIPHERAL                             ENET   /*!< Device name: ENET */
#define BOARD_INITENETPINS_ENET_RXER_SIGNAL                           enet_rx_er   /*!< ENET signal: enet_rx_er */
#define BOARD_INITENETPINS_ENET_RXER_PIN_NAME                      GPIO_AD_B0_12   /*!< Pin name */
#define BOARD_INITENETPINS_ENET_RXER_LABEL            "ENET_RXER/U11[20]/J19[4]"   /*!< Label */
#define BOARD_INITENETPINS_ENET_RXER_NAME                            "ENET_RXER"   /*!< Identifier name */

/* GPIO_AD_B0_09 (number 99), ENET_RXD1/U11[15]/J17[3] */
#define BOARD_INITENETPINS_ENET_RXD1_PERIPHERAL                             ENET   /*!< Device name: ENET */
#define BOARD_INITENETPINS_ENET_RXD1_SIGNAL                         enet_rx_data   /*!< ENET signal: enet_rx_data */
#define BOARD_INITENETPINS_ENET_RXD1_CHANNEL                                  1U   /*!< ENET enet_rx_data channel: 1 */
#define BOARD_INITENETPINS_ENET_RXD1_PIN_NAME                      GPIO_AD_B0_09   /*!< Pin name */
#define BOARD_INITENETPINS_ENET_RXD1_LABEL            "ENET_RXD1/U11[15]/J17[3]"   /*!< Label */
#define BOARD_INITENETPINS_ENET_RXD1_NAME                            "ENET_RXD1"   /*!< Identifier name */

/* GPIO_AD_B0_10 (number 98), ENET_RXD0/U11[16]/J19[6] */
#define BOARD_INITENETPINS_ENET_RXD0_PERIPHERAL                             ENET   /*!< Device name: ENET */
#define BOARD_INITENETPINS_ENET_RXD0_SIGNAL                         enet_rx_data   /*!< ENET signal: enet_rx_data */
#define BOARD_INITENETPINS_ENET_RXD0_CHANNEL                                  0U   /*!< ENET enet_rx_data channel: 0 */
#define BOARD_INITENETPINS_ENET_RXD0_PIN_NAME                      GPIO_AD_B0_10   /*!< Pin name */
#define BOARD_INITENETPINS_ENET_RXD0_LABEL            "ENET_RXD0/U11[16]/J19[6]"   /*!< Label */
#define BOARD_INITENETPINS_ENET_RXD0_NAME                            "ENET_RXD0"   /*!< Identifier name */

/* GPIO_EMC_40 (number 116), ENET_MDIO/U11[11] */
#define BOARD_INITENETPINS_ENET_MDIO_PERIPHERAL                             ENET   /*!< Device name: ENET */
#define BOARD_INITENETPINS_ENET_MDIO_SIGNAL                            enet_mdio   /*!< ENET signal: enet_mdio */
#define BOARD_INITENETPINS_ENET_MDIO_PIN_NAME                        GPIO_EMC_40   /*!< Pin name */
#define BOARD_INITENETPINS_ENET_MDIO_LABEL                   "ENET_MDIO/U11[11]"   /*!< Label */
#define BOARD_INITENETPINS_ENET_MDIO_NAME                            "ENET_MDIO"   /*!< Identifier name */

/* GPIO_EMC_41 (number 115), ENET_MDC/U11[12] */
#define BOARD_INITENETPINS_ENET_MDC_PERIPHERAL                              ENET   /*!< Device name: ENET */
#define BOARD_INITENETPINS_ENET_MDC_SIGNAL                              enet_mdc   /*!< ENET signal: enet_mdc */
#define BOARD_INITENETPINS_ENET_MDC_PIN_NAME                         GPIO_EMC_41   /*!< Pin name */
#define BOARD_INITENETPINS_ENET_MDC_LABEL                     "ENET_MDC/U11[12]"   /*!< Label */
#define BOARD_INITENETPINS_ENET_MDC_NAME                              "ENET_MDC"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitENETPins(void);

/* GPIO_SD_B0_03 (number 45), SD1_CLK/J15[5] */
#define BOARD_INITUSDHCPINS_SD1_CLK_PERIPHERAL                            USDHC1   /*!< Device name: USDHC1 */
#define BOARD_INITUSDHCPINS_SD1_CLK_SIGNAL                             usdhc_clk   /*!< USDHC1 signal: usdhc_clk */
#define BOARD_INITUSDHCPINS_SD1_CLK_PIN_NAME                       GPIO_SD_B0_03   /*!< Pin name */
#define BOARD_INITUSDHCPINS_SD1_CLK_LABEL                       "SD1_CLK/J15[5]"   /*!< Label */
#define BOARD_INITUSDHCPINS_SD1_CLK_NAME                               "SD1_CLK"   /*!< Identifier name */

/* GPIO_SD_B0_02 (number 46), SD1_CMD/J15[3] */
#define BOARD_INITUSDHCPINS_SD1_CMD_PERIPHERAL                            USDHC1   /*!< Device name: USDHC1 */
#define BOARD_INITUSDHCPINS_SD1_CMD_SIGNAL                             usdhc_cmd   /*!< USDHC1 signal: usdhc_cmd */
#define BOARD_INITUSDHCPINS_SD1_CMD_PIN_NAME                       GPIO_SD_B0_02   /*!< Pin name */
#define BOARD_INITUSDHCPINS_SD1_CMD_LABEL                       "SD1_CMD/J15[3]"   /*!< Label */
#define BOARD_INITUSDHCPINS_SD1_CMD_NAME                               "SD1_CMD"   /*!< Identifier name */

/* GPIO_SD_B0_04 (number 43), SD1_D0/J15[7] */
#define BOARD_INITUSDHCPINS_SD1_D0_PERIPHERAL                             USDHC1   /*!< Device name: USDHC1 */
#define BOARD_INITUSDHCPINS_SD1_D0_SIGNAL                             usdhc_data   /*!< USDHC1 signal: usdhc_data */
#define BOARD_INITUSDHCPINS_SD1_D0_CHANNEL                                    0U   /*!< USDHC1 usdhc_data channel: 0 */
#define BOARD_INITUSDHCPINS_SD1_D0_PIN_NAME                        GPIO_SD_B0_04   /*!< Pin name */
#define BOARD_INITUSDHCPINS_SD1_D0_LABEL                         "SD1_D0/J15[7]"   /*!< Label */
#define BOARD_INITUSDHCPINS_SD1_D0_NAME                                 "SD1_D0"   /*!< Identifier name */

